tap "azure/functions"
tap "nats-io/nats-tools"
brew "awscli"
brew "azure-cli"
brew "cilium-cli"
brew "docker-compose"
brew "gh"
brew "gitleaks"
brew "gws"
brew "k9s"
brew "libpq", link: true
brew "minikube"
brew "mockery"
brew "opentofu"
brew "terminal-notifier"
brew "terraform"
brew "uv"
brew "yq"
brew "nats-io/nats-tools/nats"
cask "1password"
cask "1password-cli"
cask "claude"
cask "claude-code"
cask "displaylink"
cask "google-chrome"
cask "logi-options+"
cask "notion"
cask "orbstack"
cask "pgadmin4"
cask "raycast"
cask "slack"
cask "stats"
cask "tailscale"
cask "visual-studio-code"
cask "warp"
cask "wispr-flow"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "azurite.azurite"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "buenon.scratchpads"
vscode "castwide.solargraph"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dariofuzinato.vue-peek"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-codeql"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "gulajavaministudio.mayukaithemevsc"
vscode "hacker0x01.hackerone-vs-code-theme"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "jackiotyu.git-worktree-manager"
vscode "johnpapa.vscode-peacock"
vscode "kleber-swf.unity-code-snippets"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "p1c2u.docker-compose"
vscode "sleistner.vscode-fileutils"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "tobiah.unity-tools"
vscode "vintharas.learn-vim"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "github.com/vektra/mockery/v2"
go "honnef.co/go/tools/cmd/staticcheck"
npm "corepack"
npm "yarn"
